-- Представлення, яке розміщує один набір рядків під іншим
select user_id, vk_id as foreign_id from login_vk
union all
select '-------', '-------'
union all
select user_id, fb_id as foreign_id from login_fb

-- Представлення, яке поєднує пов’язані рядки JOIN ~ EQUI-JOIN ~ INNER JOIN

-- Представлення, яке знаходить однакові рядки в двох таблицях[1, стор.66].

-- Представлення, яке повертає записи із значеннями, яких немає в іншій таблиці
-- ANTI-JOIN ~ LEFT (RIGHT) OUTER JOIN ~ LEFT (RIGHT) JOIN

-- Представлення, яке повертає записи із значеннями, для яких немає
-- відповідності в іншій таблиці.

-- Представлення, в якому реалізовано незалежне додавання об’єднань у запит.

-- Представлення, в якому реалізовано об’єднання з використанням агрегатних функцій.

-- Представлення, в якому реалізовано зовнішнє об’єднання з використанням агрегатних функцій.

-- Представлення, в якому відсутні дані в кількох таблицях FULL OUTER JOIN

-- Представлення, в якому містяться NULL-значення в операціях та порівняннях.
